//# include <iostream>
//using namespace std;
//
//// -----------------------------------------------------------------
//// 자료형/ 음수 표현 방식(2의 보수법)/ 자료형의 size
//
//int main() {
//
//	int i = 5;	// 변수
//	
//	const int j = 7;	// 상수 , 32bit
//	// j = 8;	// 불가(상수이기 때문에 변경 불가)
//
//	cout << i << endl;
//	cout << j << endl;
//
//	short s1 = 65535;	// -1 출력
//	unsigned short s2 = 65535;	// 65535 출력
//
//	cout << s1 << endl;
//	cout << s2 << endl;
//	
//	/* < signed, unsigned >
//	- 음수 표현 하냐 안하냐 차이
//	- signed : 음수 ~ 양수 표현, 16bit 중 절반은 음수 표현에 할당 -> -1 출력
//	- unsigned : 양수 표현, 16bit 모두 양수 표현에 할당 -> 65535 출력
//	  
//	  <참고>
//	  1111 1111 1111 1111
//	+                   1
//	----------------------
//	 10000 0000 0000 0000
//	
//	*/ 
//
//
//}
//
